app/controllers/admin_controller.rb

SELECT "products".* FROM "products"
SELECT COUNT(*) FROM "products"
SELECT "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
---
  def index
    @search = params[:search]

    @products = Product.all
    @products = @products
      .where("title LIKE ? or description LIKE ?", "%#{@search}%", "%#{@search}%") if @search.present?
    @products = @products.page(params[:page]).per(12)

    respond_to do |format|
      format.html
      format.csv { send_data generate_csv(Product.all), file_name: 'products.csv' }