app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE (category_name LIKE '%men%' or description LIKE '%men%') LIMIT ? OFFSET ?  [["LIMIT", 12], ["OFFSET", 0]]
---
  def index
    @categories = Category.all
    @search = params[:search]

    @categories = Category.all
    @categories = @categories
      .where("category_name LIKE ? or description LIKE ?", "%#{@search}%", "%#{@search}%") if @search.present?
    @categories = @categories.page(params[:page]).per(12)

INSERT INTO "categories" ("category_name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category_name", "men"], ["description", "asd"], ["created_at", "2021-03-25 20:09:05.496705"], ["updated_at", "2021-03-25 20:09:05.496705"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save