app/controllers/home_controller.rb

  def index
    @search = params[:search]

    @products = Product.all
    @products = @products
      .where("title LIKE ? or description LIKE ?", "%#{@search}%", "%#{@search}%") if @search.present?
    @products = @products.page(params[:page]).per(12)
---
SELECT "products".* FROM "products"
SELECT COUNT(*) FROM "products" WHERE (title LIKE '%a%' or description LIKE '%a%')