app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "catagorie", "description", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "new"], ["catagorie", "MEN"], ["description", "new"], ["stock", 1], ["created_at", "2021-03-18 14:24:01.222850"], ["updated_at", "2021-03-18 14:24:01.222850"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "abc"], ["description", "abc"], ["updated_at", "2021-03-17 18:03:11.363073"], ["id", 7]]

  def csv_upload
    data = params[:csv_file].read.split("\n")
    data.each do |line|
      attr = line.split(",").map(&:strip)
      Product.create title: attr[0], description: attr[1], stock: 0
---
INSERT INTO "products" ("title", "description", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["description", "testtesttest"], ["stock", 0], ["created_at", "2021-03-31 19:53:14.747295"], ["updated_at", "2021-03-31 19:53:14.747295"]]