app/views/products/_form.slim

SELECT "categories".* FROM "categories"
---
  br
  div = f.collection_check_boxes :category_ids, Category.all, :id, :category_name