app/views/products/show.slim

div = "Categories : "
- @product.categories.each do |c|
---
SELECT "categories".* FROM "categories" INNER JOIN "categories_products" ON "categories"."id" = "categories_products"."category_id" WHERE "categories_products"."product_id" = ?  [["product_id", 27]]